swak4foam/Examples/DynamicMesh/switchedTJunction/0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    left
    {
        type            inletOutlet;
        value              $internalField;
        inletValue              $internalField;
    }

    right
    {
        $left;
    }

    inlet {
        //        type zeroGradient;
        type            fixedValue;
        value           $internalField;
    }

    defaultFaces
    {
        type            zeroGradient;
        //        type fixedValue;
        value $internalField;
    }

    "ACMI_.*_blockage"
    {
        $defaultFaces;
    }
    "ACMI_.*_couple"
    {
        type  cyclicACMI;
        value uniform 300;
    }
}

// ************************************************************************* //
